Repository: manaflow-ai/cmuxterm
Catalog: Packages/macOS/CmuxReadAloud/Sources/CmuxReadAloud/Resources/ReadAloudSettings.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, km, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# consent.help
source: Optional. Read Aloud remains unavailable until you opt in and save an API key. Turn this off to prevent future requests.
ar: اختياري. تظل القراءة بصوت عالٍ غير متاحة حتى توافق وتحفظ مفتاح API. عطّل هذا الخيار لمنع الطلبات المستقبلية.
bs: Neobavezno. Čitanje naglas ostaje nedostupno dok ne date pristanak i sačuvate API ključ. Isključite ovu opciju da spriječite buduće zahtjeve.
da: Valgfrit. Læs op er ikke tilgængelig, før du giver samtykke og gemmer en API-nøgle. Slå dette fra for at forhindre fremtidige anmodninger.
de: Optional. „Vorlesen“ ist erst verfügbar, wenn Sie einwilligen und einen API-Schlüssel speichern. Deaktivieren Sie diese Option, um zukünftige Anfragen zu verhindern.
es: Opcional. Leer en voz alta no estará disponible hasta que des tu consentimiento y guardes una clave de API. Desactiva esta opción para impedir futuras solicitudes.
fr: Facultatif. La lecture à voix haute reste indisponible tant que vous n’avez pas donné votre consentement et enregistré une clé API. Désactivez cette option pour empêcher toute nouvelle requête.
it: Facoltativo. Leggi ad alta voce rimane non disponibile finché non dai il consenso e salvi una chiave API. Disattiva questa opzione per impedire richieste future.
ja: 同意は任意です。同意して API キーを保存するまで読み上げは利用できません。オフにすると、以降のリクエストは送信されません。
km: ជាជម្រើស។ មុខងារអានឮៗនៅតែមិនអាចប្រើបាន រហូតដល់អ្នកយល់ព្រម និងរក្សាទុកសោ API។ បិទជម្រើសនេះដើម្បីទប់ស្កាត់សំណើនាពេលអនាគត។
ko: 선택 사항입니다. 전송에 동의하고 API 키를 저장하기 전까지는 소리 내어 읽기를 사용할 수 없습니다. 이후 요청을 차단하려면 이 옵션을 끄세요.
nb: Valgfritt. Les høyt er utilgjengelig frem til du gir samtykke og lagrer en API-nøkkel. Slå av dette for å forhindre fremtidige forespørsler.
pl: Opcjonalne. Funkcja Czytaj na głos pozostaje niedostępna, dopóki nie wyrazisz zgody i nie zapiszesz klucza API. Wyłącz tę opcję, aby zapobiec wysyłaniu kolejnych żądań.
pt_br: Opcional. Ler em voz alta permanece indisponível até que você dê seu consentimento e salve uma chave de API. Desative esta opção para impedir solicitações futuras.
ru: Необязательно. Чтение вслух недоступно, пока вы не дадите согласие и не сохраните API-ключ. Отключите этот параметр, чтобы предотвратить дальнейшие запросы.
th: ไม่บังคับ การอ่านออกเสียงจะยังใช้งานไม่ได้จนกว่าคุณจะให้ความยินยอมและบันทึกคีย์ API ปิดตัวเลือกนี้เพื่อป้องกันการส่งคำขอในอนาคต
tr: İsteğe bağlıdır. İzin verip bir API anahtarı kaydedene kadar Sesli Oku kullanılamaz. Gelecekteki istekleri engellemek için bu seçeneği kapatın.
uk: Необов’язково. Функція «Читати вголос» залишатиметься недоступною, доки ви не надасте згоду та не збережете API-ключ. Вимкніть цей параметр, щоб запобігти подальшим запитам.
zh_hans: 可选。在你同意并保存 API 密钥之前，朗读功能不可用。关闭此选项可阻止后续请求。
zh_hant: 此為選用項目。在您同意並儲存 API 金鑰之前，將無法使用「朗讀」。關閉此選項即可阻止後續請求。

# error.unsupportedModel
source: Choose the Turbo or HD speech-2.8 model.
ar: اختر نموذج speech-2.8 بإصدار Turbo أو HD.
bs: Odaberite model govora speech-2.8 Turbo ili HD.
da: Vælg speech-2.8-modellen Turbo eller HD.
de: Wählen Sie das Modell speech-2.8 in der Variante Turbo oder HD.
es: Elige el modelo speech-2.8 Turbo o HD.
fr: Choisissez le modèle speech-2.8 Turbo ou HD.
it: Scegli il modello speech-2.8 Turbo o HD.
ja: speech-2.8 の Turbo または HD モデルを選択してください。
km: ជ្រើសរើសម៉ូដែល speech-2.8 ប្រភេទ Turbo ឬ HD។
ko: Turbo 또는 HD speech-2.8 모델을 선택하세요.
nb: Velg talemodellen speech-2.8 i Turbo- eller HD-versjon.
pl: Wybierz model speech-2.8 w wersji Turbo lub HD.
pt_br: Escolha o modelo speech-2.8 Turbo ou HD.
ru: Выберите модель синтеза речи speech-2.8 Turbo или HD.
th: เลือกโมเดล speech-2.8 แบบ Turbo หรือ HD
tr: Turbo veya HD speech-2.8 modelini seçin.
uk: Виберіть модель speech-2.8 Turbo або HD.
zh_hans: 请选择 Turbo 或 HD speech-2.8 模型。
zh_hant: 請選擇 Turbo 或 HD 的 speech-2.8 模型。

# error.emptyVoice
source: Enter a MiniMax voice ID.
ar: أدخل معرّف صوت من MiniMax.
bs: Unesite MiniMax ID glasa.
da: Indtast et MiniMax-stemme-id.
de: Geben Sie eine MiniMax-Stimmen-ID ein.
es: Introduce un ID de voz de MiniMax.
fr: Saisissez un identifiant de voix MiniMax.
it: Inserisci un ID voce MiniMax.
ja: MiniMax 音声 ID を入力してください。
km: បញ្ចូល ID សំឡេងរបស់ MiniMax។
ko: MiniMax 음성 ID를 입력하세요.
nb: Skriv inn en MiniMax-stemme-ID.
pl: Wprowadź identyfikator głosu MiniMax.
pt_br: Insira um ID de voz da MiniMax.
ru: Введите идентификатор голоса MiniMax.
th: ป้อน ID เสียงของ MiniMax
tr: Bir MiniMax ses kimliği girin.
uk: Введіть ідентифікатор голосу MiniMax.
zh_hans: 请输入 MiniMax 音色 ID。
zh_hant: 請輸入 MiniMax 聲音 ID。

# error.invalidSpeed
source: Speech speed must be a finite number from 0.5 to 2.
ar: يجب أن تكون سرعة الكلام عددًا منتهيًا بين 0.5 و2.
bs: Brzina govora mora biti konačan broj od 0,5 do 2.
da: Talehastigheden skal være et endeligt tal fra 0,5 til 2.
de: Die Sprechgeschwindigkeit muss eine endliche Zahl zwischen 0,5 und 2 sein.
es: La velocidad de lectura debe ser un número finito entre 0,5 y 2.
fr: La vitesse de synthèse vocale doit être un nombre fini compris entre 0,5 et 2.
it: La velocità di lettura deve essere un numero finito compreso tra 0,5 e 2.
ja: 読み上げ速度には 0.5 から 2 の有限の数値を指定してください。
km: ល្បឿនអានត្រូវតែជាចំនួនមានកំណត់ចាប់ពី 0.5 ដល់ 2។
ko: 음성 속도는 0.5에서 2 사이의 유한한 숫자여야 합니다.
nb: Talehastigheten må være et endelig tall fra 0,5 til 2.
pl: Szybkość mowy musi być skończoną liczbą od 0,5 do 2.
pt_br: A velocidade da fala deve ser um número finito entre 0,5 e 2.
ru: Скорость речи должна быть конечным числом от 0,5 до 2.
th: ความเร็วเสียงพูดต้องเป็นตัวเลขที่มีค่าจำกัดตั้งแต่ 0.5 ถึง 2
tr: Konuşma hızı, 0,5 ile 2 arasında sonlu bir sayı olmalıdır.
uk: Швидкість мовлення має бути скінченним числом від 0.5 до 2.
zh_hans: 语速必须为 0.5 到 2 之间的有限数值。
zh_hant: 語音速度必須為介於 0.5 到 2 之間的有限數值。

# error.emptyCredential
source: Enter a MiniMax API key before saving.
ar: أدخل مفتاح API لخدمة MiniMax قبل الحفظ.
bs: Unesite MiniMax API ključ prije čuvanja.
da: Indtast en MiniMax-API-nøgle, før du gemmer.
de: Geben Sie vor dem Speichern einen MiniMax-API-Schlüssel ein.
es: Introduce una clave de API de MiniMax antes de guardar.
fr: Saisissez une clé API MiniMax avant d’enregistrer.
it: Inserisci una chiave API MiniMax prima di salvare.
ja: 保存する前に MiniMax API キーを入力してください。
km: បញ្ចូលសោ API របស់ MiniMax មុនពេលរក្សាទុក។
ko: 저장하기 전에 MiniMax API 키를 입력하세요.
nb: Skriv inn en MiniMax API-nøkkel før du lagrer.
pl: Przed zapisaniem wprowadź klucz API MiniMax.
pt_br: Insira uma chave de API da MiniMax antes de salvar.
ru: Перед сохранением введите API-ключ MiniMax.
th: ป้อนคีย์ API ของ MiniMax ก่อนบันทึก
tr: Kaydetmeden önce bir MiniMax API anahtarı girin.
uk: Введіть API-ключ MiniMax перед збереженням.
zh_hans: 请先输入 MiniMax API 密钥再保存。
zh_hant: 請先輸入 MiniMax API 金鑰再儲存。

# error.invalidCredential
source: The saved API key cannot be read. Replace or remove it in Read Aloud settings.
ar: تعذّرت قراءة مفتاح API المحفوظ. استبدله أو أزله في إعدادات القراءة بصوت عالٍ.
bs: Sačuvani API ključ nije moguće pročitati. Zamijenite ga ili uklonite u postavkama čitanja naglas.
da: Den gemte API-nøgle kan ikke læses. Erstat eller fjern den i indstillingerne for Læs op.
de: Der gespeicherte API-Schlüssel kann nicht gelesen werden. Ersetzen oder entfernen Sie ihn in den Einstellungen für „Vorlesen“.
es: No se puede leer la clave de API guardada. Sustitúyela o elimínala en los ajustes de Leer en voz alta.
fr: La clé API enregistrée ne peut pas être lue. Remplacez-la ou supprimez-la dans les réglages de lecture à voix haute.
it: Impossibile leggere la chiave API salvata. Sostituiscila o rimuovila nelle impostazioni di Leggi ad alta voce.
ja: 保存済みの API キーを読み取れません。読み上げ設定で置き換えるか削除してください。
km: មិនអាចអានសោ API ដែលបានរក្សាទុកបានទេ។ សូមជំនួស ឬដកវាចេញក្នុងការកំណត់អានឮៗ។
ko: 저장된 API 키를 읽을 수 없습니다. 소리 내어 읽기 설정에서 키를 교체하거나 제거하세요.
nb: Den lagrede API-nøkkelen kan ikke leses. Erstatt eller fjern den i innstillingene for Les høyt.
pl: Nie można odczytać zapisanego klucza API. Zastąp go lub usuń w ustawieniach funkcji Czytaj na głos.
pt_br: Não foi possível ler a chave de API salva. Substitua ou remova a chave nos ajustes de Ler em voz alta.
ru: Не удалось прочитать сохранённый API-ключ. Замените или удалите его в настройках чтения вслух.
th: ไม่สามารถอ่านคีย์ API ที่บันทึกไว้ได้ แทนที่หรือนำคีย์ออกในการตั้งค่าการอ่านออกเสียง
tr: Kaydedilmiş API anahtarı okunamıyor. Sesli Oku ayarlarında anahtarı değiştirin veya kaldırın.
uk: Не вдалося прочитати збережений API-ключ. Замініть або видаліть його в налаштуваннях «Читати вголос».
zh_hans: 无法读取已保存的 API 密钥。请在朗读设置中替换或移除该密钥。
zh_hant: 無法讀取已儲存的 API 金鑰。請在「朗讀」設定中取代或移除金鑰。

# error.invalidService
source: The app has not configured a Keychain service for Read Aloud.
ar: لم يهيّئ التطبيق خدمة سلسلة المفاتيح للقراءة بصوت عالٍ.
bs: Aplikacija nije podesila uslugu privjeska ključeva (Keychain) za čitanje naglas.
da: Appen har ikke konfigureret en nøgleringstjeneste til Læs op.
de: Die App hat keinen Schlüsselbunddienst für „Vorlesen“ konfiguriert.
es: La app no ha configurado un servicio del llavero para Leer en voz alta.
fr: L’application n’a pas configuré de service de trousseau pour la lecture à voix haute.
it: L'app non ha configurato un servizio Portachiavi per Leggi ad alta voce.
ja: アプリで読み上げ用のキーチェーンサービスが設定されていません。
km: កម្មវិធីមិនទាន់បានកំណត់រចនាសម្ព័ន្ធសេវា Keychain សម្រាប់មុខងារអានឮៗទេ។
ko: 앱에 소리 내어 읽기용 키체인 서비스가 구성되어 있지 않습니다.
nb: Appen har ikke konfigurert en nøkkelringtjeneste for Les høyt.
pl: Aplikacja nie skonfigurowała usługi pęku kluczy dla funkcji Czytaj na głos.
pt_br: O app não configurou um serviço das Chaves para Ler em voz alta.
ru: В приложении не настроена служба Связки ключей для чтения вслух.
th: แอปยังไม่ได้กำหนดค่าบริการพวงกุญแจสำหรับการอ่านออกเสียง
tr: Uygulama, Sesli Oku için bir Anahtar Zinciri hizmeti yapılandırmamış.
uk: Програма не налаштувала службу В’язки ключів для функції «Читати вголос».
zh_hans: 应用尚未为朗读配置钥匙串服务。
zh_hant: App 尚未為「朗讀」設定鑰匙圈服務。

# error.keychain
source: Keychain could not complete the operation (status %d). Your requested change was not confirmed.
ar: تعذّر على سلسلة المفاتيح إكمال العملية (الحالة %d). لم يتم تأكيد التغيير الذي طلبته.
bs: Privjesak ključeva (Keychain) nije mogao dovršiti radnju (status %d). Tražena izmjena nije potvrđena.
da: Nøgleringen kunne ikke fuldføre handlingen (status %d). Den ønskede ændring blev ikke bekræftet.
de: Der Schlüsselbund konnte den Vorgang nicht abschließen (Status %d). Ihre angeforderte Änderung wurde nicht bestätigt.
es: El llavero no ha podido completar la operación (estado %d). No se ha confirmado el cambio solicitado.
fr: Le trousseau n’a pas pu terminer l’opération (statut %d). La modification demandée n’a pas été confirmée.
it: Il Portachiavi non ha potuto completare l'operazione (stato %d). La modifica richiesta non è stata confermata.
ja: キーチェーンの操作を完了できませんでした（ステータス %d）。変更は確認されていません。
km: Keychain មិនអាចបញ្ចប់ប្រតិបត្តិការបានទេ (ស្ថានភាព %d)។ ការផ្លាស់ប្ដូរដែលអ្នកបានស្នើមិនត្រូវបានបញ្ជាក់ទេ។
ko: 키체인에서 작업을 완료하지 못했습니다(상태 %d). 요청한 변경 사항이 적용되었는지 확인되지 않았습니다.
nb: Nøkkelringen kunne ikke fullføre operasjonen (status %d). Den forespurte endringen ble ikke bekreftet.
pl: Pęk kluczy nie mógł ukończyć operacji (status %d). Żądana zmiana nie została potwierdzona.
pt_br: As Chaves não conseguiram concluir a operação (status %d). A alteração solicitada não foi confirmada.
ru: Связке ключей не удалось завершить операцию (статус %d). Запрошенное изменение не подтверждено.
th: พวงกุญแจไม่สามารถดำเนินการให้เสร็จสมบูรณ์ได้ (สถานะ %d) การเปลี่ยนแปลงที่คุณร้องขอยังไม่ได้รับการยืนยัน
tr: Anahtar Zinciri işlemi tamamlayamadı (durum %d). İstediğiniz değişiklik doğrulanamadı.
uk: В’язці ключів не вдалося завершити операцію (статус %d). Запитану вами зміну не підтверджено.
zh_hans: 钥匙串无法完成操作（状态 %d）。你请求的更改尚未确认。
zh_hant: 鑰匙圈無法完成操作（狀態 %d）。無法確認您要求的變更是否已完成。

# error.persistence
source: Read Aloud settings could not be saved. Your change was not confirmed. Try again.
ar: تعذّر حفظ إعدادات القراءة بصوت عالٍ. لم يتم تأكيد التغيير. حاول مجددًا.
bs: Postavke čitanja naglas nije moguće sačuvati. Vaša izmjena nije potvrđena. Pokušajte ponovo.
da: Indstillingerne for Læs op kunne ikke gemmes. Din ændring blev ikke bekræftet. Prøv igen.
de: Die Einstellungen für „Vorlesen“ konnten nicht gespeichert werden. Ihre Änderung wurde nicht bestätigt. Versuchen Sie es erneut.
es: No se han podido guardar los ajustes de Leer en voz alta. No se ha confirmado el cambio. Inténtalo de nuevo.
fr: Les réglages de lecture à voix haute n’ont pas pu être enregistrés. Votre modification n’a pas été confirmée. Réessayez.
it: Impossibile salvare le impostazioni di Leggi ad alta voce. La modifica non è stata confermata. Riprova.
ja: 読み上げ設定を保存できませんでした。変更は確認されていません。もう一度お試しください。
km: មិនអាចរក្សាទុកការកំណត់អានឮៗបានទេ។ ការផ្លាស់ប្ដូររបស់អ្នកមិនត្រូវបានបញ្ជាក់ទេ។ សូមព្យាយាមម្ដងទៀត។
ko: 소리 내어 읽기 설정을 저장하지 못했습니다. 변경 사항이 적용되었는지 확인되지 않았습니다. 다시 시도하세요.
nb: Innstillingene for Les høyt kunne ikke lagres. Endringen din ble ikke bekreftet. Prøv igjen.
pl: Nie udało się zapisać ustawień funkcji Czytaj na głos. Zmiana nie została potwierdzona. Spróbuj ponownie.
pt_br: Não foi possível salvar os ajustes de Ler em voz alta. Sua alteração não foi confirmada. Tente novamente.
ru: Не удалось сохранить настройки чтения вслух. Ваше изменение не подтверждено. Повторите попытку.
th: ไม่สามารถบันทึกการตั้งค่าการอ่านออกเสียงได้ การเปลี่ยนแปลงของคุณยังไม่ได้รับการยืนยัน ลองอีกครั้ง
tr: Sesli Oku ayarları kaydedilemedi. Değişikliğiniz doğrulanamadı. Tekrar deneyin.
uk: Не вдалося зберегти налаштування «Читати вголос». Вашу зміну не підтверджено. Спробуйте ще раз.
zh_hans: 无法保存朗读设置。你的更改尚未确认。请重试。
zh_hant: 無法儲存朗讀設定。無法確認您的變更是否已完成。請再試一次。
